tutorials/laminar/1DBedLoad/constant/kineticTheoryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      kineticTheoryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kineticTheory   off;

equilibrium     off;

limitProduction off;

extended        off;

e               e [ 0 0 0 0 0 0 0 ] 0.9;

alphasMax        alphasMax [ 0 0 0 0 0 0 0 ] 0.635;

alphasMinFriction alphasMinFriction [ 0 0 0 0 0 0 0 ] 0.57;

DiluteCut       DiluteCut [ 0 0 0 0 0 0 0 ] 0.000001;

ttzero          ttzero [ 0 0 1 0 0 0 0 ] 0;

ttone          ttone [ 0 0 1 0 0 0 0 ] 0;

MaxTheta       MaxTheta [ 0 2 -2 0 0 0 0 ] 0.5;

Fr              Fr [ 1 -1 -2 0 0 0 0 ] 0.05;

eta             eta [ 0 0 0 0 0 0 0 ] 3;

p               p [ 0 0 0 0 0 0 0 ] 5;

phi             phi [ 0 0 0 0 0 0 0 ] 18.66;

KineticJ1      KineticJ1 [ 0 0 0 0 0 0 0 ] 1; //turn off the viscous dissipation

KineticJ2       KineticJ2 [ 0 0 0 0 0 0 0] 0;

KineticJ3       KineticJ3 [ 0 0 0 0 0 0 0] 0;

killJ1_         killJ1_ [ 0 0 0 0 0 0 0] 1;

viscosityModel  Syamlal;

conductivityModel Syamlal;

granularPressureModel Lun;

frictionalStressModel SrivastavaSundaresan;

radialModel     CarnahanStarling;

// ************************************************************************* //
