tutorials/laminar/1DBedLoad/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * sediment properties * * * * * * * * * * * * //
phasesol
{
    rho             rho [ 1 -3 0 0 0 ] 1190;
    nu              nu [ 0 2 -1 0 0 ] 1e-6;
    d               d [ 0 1 0 0 0 0 0 ] 2.e-3;
}

phasewat
{
    rho             rho [ 1 -3 0 0 0 ] 1070;
    nu              nu [ 0 2 -1 0 0 ] 2.52e-4;
    d               d [ 0 1 0 0 0 0 0 ] 2.e-3;
}

phasegas
{
    rho             rho [ 1 -3 0 0 0 ] 1.2;
    nu              nu [ 0 2 -1 0 0 ] 1.48e-05;
    d               d [ 0 1 0 0 0 0 0 ] 290e-6;
}

//*********************************************************************** //
transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 2.52e-4;

nuMax           nuMax [0 2 -1 0 0 0 0] 1e1;      // viscosity limiter for the Frictional model (required for stability)

alphasSmall      alphasSmall [ 0 0 0 0 0 0 0 ] 1e-6;  // minimum volume fraction (phase a) for division by alpha 

// ************************************************************************* //
