tutorials/laminar/1DBedLoad/Allrun
#!/bin/sh

# Create the mesh
blockMesh

# create the intial time folder
cp -r 0_org 0

# Run sedFoam
sedInterFoam > log&
